[
  {
    "Name": "Artichokes",
    "Link": "https://www.almanac.com/plant/artichokes",
    "Image URL": "https://www.almanac.com/sites/default/files/styles/square_thumbnail/public/image_nodes/artichoke-close.jpg?itok=vXCsyB9q",
    "Photo Credit": "Pixabay",
    "Botanical Name": "Cynara cardunculus var. scolymus",
    "Plant Type": "Vegetable",
    "Sun Exposure": "Full Sun",
    "Soil pH": "Slightly Acidic to Neutral",
    "Bloom Time": "Summer",
    "Flower Color": "Purple",
    "Hardiness Zone": "5\n6\n7\n8\n9\n10\n11",
    "Subhead": "Planting, Growing, and Harvesting Artichokes\nDecember 17, 2024\n\nThe globe artichoke is a perennial in the thistle family that produces long, silver-green, lobed leaves that make the artichoke look like a giant fern. Learn how to plant and grow edible artichokes in your garden! About Artichokes The buds (i.e., the “artichokes” that we harvest and eat), if allowed to flower, are thistle-like and violet. These large plants can be grown in rows in the garden, as informal hedges, or planted as a wide border. Artichokes can reach heights of 3 to 5 feet. Artichokes prefer cool, humid summers and mild winters. In cool regions, plan to treat the artichoke as an annual. One plant will produce many artichokes. The biggest bud grows on the top of the plant, and many smaller ones grow beneath. Even if you don’t like to eat artichokes, they’re still worth growing for their lovely, pollinator-friendly flowers!",
    "Planting": {
      "content": "Choose a spot in the garden that gets full sun (at least 6-8 hours of direct sunlight per day). Artichokes are heavy feeders. For each plant, mix a shovel of compost or aged manure into the soil before planting. They require consistent moisture but do not like to be in waterlogged soil.",
      "sub_headings": {
        "When to Plant Artichokes": "Artichokes can be started from seeds, from rooted shoots taken from growing plants, or from dormant roots. If starting from seeds: Start seeds indoors in late winter or early spring, about 8-10 weeks before planting outside. Soak the seeds in warm water before sowing in trays or pots. Place the trays or pots in a warm spot with bright light. Keep the soil moist. Plant seedlings and shoots in the garden in the spring after the last spring frost . Dormant roots can be planted in the fall or winter in frost-free regions. In cooler climates, plant the roots in the spring after the last frost.",
        "How to Plant Artichoke": "Space each plant three to four feet apart in rows and leave four to five feet between the rows. Plant the shoots and dormant roots about six inches deep. The tops should be above ground level. Water deeply at the time of planting."
      }
    },
    "Growing": {
      "content": "Keep the soil moist. Artichokes need lots of water to form the edible buds. Mulch around the plants to keep the moisture in the soil. Apply a balanced organic fertilizer once every month during the growing season. Remove the mulch when the plants begin to bud and cover the soil around the plants with compost. Artichoke plants will go dormant in hot weather. When temperatures cool off in late summer and fall, the plants will start growing again and you may get a second harvest. In cooler regions, after the fall harvest, cut the plants back to about 6 inches and cover the crowns of the plant with leaves. For extra winter protection, add an additional foot of straw on top. Remove the straw and leaves after the last frost in the spring.\n‘Green Globe’ matures early and is a good choice for northern gardeners. This variety can be grown as an annual. ‘Violetto’ produces purple slightly elongated buds. Best grown as a perennial. ‘Imperial Star’ has tasty round buds that mature early. It is an annual and will produce well-developed artichokes the first year from seed. Plants grow about 3 feet tall. Each produces 1-2 small primary buds and 5-7 smaller secondary buds. ‘Emerald’ has thornless buds and is very productive. It grows glossy, deep green buds on 4 to 5 feet tall plants. Grow it as a perennial in zones 7 and above.",
      "sub_headings": {
        "How to Propagate Artichokes": "Select shoots from an established plant that produced well the previous year. Remove shoots in the spring when they are about 8 inches high. Cut the shoot off below the soil, at the point where it is attached to the mother plant at the root ball. Carefully pull the roots that are attached to the shoot from the root ball. Plant the shoot in a new spot or share with friends!"
      }
    },
    "Harvesting": {
      "content": "Harvest artichoke buds when they have swelled but are still closed tight. Use a sharp knife to cut across the stem about 1 to 2 inches below the bud.\n",
      "sub_headings": {
        "How to Store Artichokes": "Sprinkle fresh artichokes with water and put them in a plastic bag. The artichokes can be stored in the refrigerator for up to two weeks. To freeze artichoke hearts, first blanch the hearts in boiling water and a splash of lemon juice for 1-2 minutes. Cool and dry the hearts before putting them in plastic freezer bags."
      }
    },
    "Pests/Diseases": "Artichoke Pests and Diseases Pest/Disease Type Symptoms Control/Prevention Aphids Insect Misshapen/yellow leaves; distorted flowers; leaf drop; sticky “honeydew” (excretion) on leaves; sooty, black mold Knock off with water spray; apply insecticidal soap; inspect new plants carefully; use slow-release fertilizers; avoid excess nitrogen; encourage lacewings, lady beetles/bugs, spiders Bacterial crown rot Bacteria Slow growth; leaves wilt; crown rots Use clean tools; start plants from disease-free transplants Botrytis (gray mold) Fungus Varies; yellow/brown/gray spots with water-soaked margins on leaves/flowers; gray mold; buds remain closed; stem lesions; wilt/rot; scorched appearance (“fire”) in some plants Destroy infected parts/severely infected plants (do not compost); remove plant debris regularly; disinfect tools; good air circulation/sunlight; avoid overhead watering; prevent plant stress/injury; weed; rotation Cabbage loopers Insect Large, ragged holes in leaves from larval feeding; defoliation; stunted or bored heads; excrement Handpick; add native plants to invite beneficial insects; spray larvae with insecticidal soap or Bacillus thuringiensis (Bt); use row covers; remove plant debris Flea beetles Insect Numerous tiny holes in leaves Use row covers; mulch heavily; add native plants to invite beneficial insects Powdery mildew Fungus Varies; white spots or flourlike coating on upper leaf surfaces; leaves drop; distortion/stunting Destroy infected parts (do not compost); remove plant debris regularly; resistant varieties; good air circulation/sunlight; spray plants with solution of 1 teaspoon baking soda/1 quart water; prevent plant stress; avoid overhead watering Slugs/snails Mollusk Irregular holes in leaves/buds; gouged buds; slimy secretion on plants/soil; seedlings “disappear” Handpick; avoid thick bark mulch; use copper plant collars; avoid overhead watering; lay boards on soil in evening, in morning lift and dispose of pests in hot, soapy water; drown in deep container of 1/2 inch of beer or of sugar water and yeast sunk to ground level; apply 1-inch-wide strip of diatomaceous earth Spider mites Insect Fine webs; yellow-specked under-side of leaves, later brown-edged or bronze or yellow leaves; leaf drop Rinse plants with water, mist daily; apply insecticidal soap",
    "Wit and Wisdom": "Historians believe that the first artichokes were grown in Sicily or North Africa. In 77 AD the Roman naturalist Pliny called the artichoke one of earth’s monstrosities. Wealthy Romans enjoyed artichokes prepared in honey and vinegar, seasoned with cumin. In the U.S., artichokes were first grown in Louisiana in the early 19th century. The vegetable was brought there by French and Spanish settlers.",
    "Recipes": "Pasta Salad With Spinach and Artichokes\nShrimp and Artichoke Casserole\nBaked Stuffed Artichokes\nSpinach Artichoke Dip Stuffed Pasta Shells",
    "Cooking Notes": "Artichokes are delicious raw or cooked. They can also be pickled or canned. Before cooking, slice off the bottom of the stem and any tough outer leaves. Cut off about 1 inch of the spiky top of the artichoke. Steam artichokes, don’t boil them. Steaming cooks them with just the right amount of moisture.\nVegetables\nADVERTISEMENT\nAdvertisement\n\n\n\n\n\nADVERTISEMENT\nHi , I have a question about my artichoke plant that I grew from a seed last spring/summer . I didn’t do any research on them so it produced a few artichokes. All my other one died this one survived through this winter in 9b zone and is now producing small artichokes the problem is most of the stocks on the mother plant have broken not all the way off can I cut them off and reroot them since they will have no roots? Please help I don’t want to loose my plant Thank You Shelly D.\nWith artichokes, you can replant a shoot! Gently clear away some soil to reveal the plant’s roots. Using a sharp knife, cut off the shoots along with their roots. Ensure the shoots are at least eight inches in length. Finally, backfill the soil around the original plant and firm up with your hands. Then plant the shoot with the roots.\nI live in Illinois, zone 7a.  Last year I did what you said, I cut back my artichoke plants in late October and then covered them with about 12 inches of leaf mulch.  It seems that IL did have a fairly wet winter with alot of snow.  When I uncovered the artichokes in the spring, they were just a mushy mess.  Everyone of them had the roots rotted.  I replanted last spring and am now ready to winterize once again but am afraid to use the same method.  What did I do wrong?  In fact the same thing happened to my raspberry bushes and strawberries.  Could you please give me suggestions?  Thank you.\nHi Jill, Sorry to hear about your artichokes. Since they are a Mediterranean crop, winter protection can be a bit tricky, although it is definitely possible to overwinter them. If your wet winter (snow and rain) was also accompanied by periods of thawing and freezing, it may not have mattered how well protected your artichoke crowns and roots were because that excessive moisture making its way into the ground followed by colder freezing temperatures is a recipe for disaster. You can certainly try to protect them inground again this year. Another way of doing it is to make a 2-foot-tall cage out of chicken wire (secured to the ground) that is 12 inches wider than the plant and fill it completely with leaves and straw. The cage will keep the leaves and straw in place. Some even recommend adding extra soil on top of the plants prior to mulching with leaves and straw. An alternative is to dig up the crowns and roots, remove as much soil as possible and store for the winter in a box of moist sand or peat in a cool location, like a garage or basement. Also, if you find yourself needing to plant new artichokes next year or in the future, consider planting varieties like Green Globe or Imperial Star, which have shorter growing seasons and are more hardy. Hope this helps!\nHow much do you cut them back in the summer? I live in zone 9b ( it's in the 100's now) and my plant is done producing and looking very ugly now.\nHi Stephanie, Artichoke is a perennial plant. Summer eat ends the harvest, toughens the edible parts and causes it to flower. Once the fruiting and harvest is done, cut back the plant (foliage and stems) to the soil level. You can either cover with mulch to initiate summer dormancy or allow the ornamental flower buds to form. Stop watering until early fall when the plant sends out new shoots in the fall. (You can stimulate a light crop in the fall by working compost into the soil around plants as growth resumes in cool weather.) If you wish, you can transplant new shoots into a new location in the garden or just leave them place to produce another year. Make sure you leave only the most vigorous shoot on the old plant for growth in the spring.\nThis year my artichokes are small and opening up completely too early.\nLast year my artichokes were green. This year they are purple...  the plant is healthy and the globes look healthy. Are they still okay?\nHi Cathy, If the plant and globes look healthy they should still be fine. Depending on your growing conditions this winter, if temperatures dip to below freezing it can change the look of the artichokes to a brown or even purple color.\nWhy are ants all over my artichokes?  They don’t seem to be eating them but there are a ton of ants on them!\nADVERTISEMENT\n\n"
  }
]